#### RDBMS- MySQL

## Necessary Modules

In [ ]:
#(** To avoid error ,first uninstall the modules if exists from before. Then install again.)
#pip3 install mysql-connector-python
# pip3 install mysqlclient
# pip3 install ipython-sql
# pip3 install mypy-extensions
# pip3 install SQLAlchemy
# pip3 install PyMySQL

## Creating a database and connecting to it

In [1]:
#Connecting to MySQL database
import mysql.connector as sql
mydb=sql.connect(host="localhost",user="root",passwd="Mahmud")
mycursor = mydb.cursor()

In [2]:
#Creating a database
mycursor.execute("CREATE DATABASE Problem_set_09")

In [ ]:
#Deleting the database
# mycursor.execute("DROP DATABASE Problem_set_09")

In [3]:
%load_ext sql

In [4]:
#Connecting to the database which was created before
%sql mysql://root:Mahmud@localhost/Problem_set_09

## Schema

![Cat](dataset/schema.png)

### Note: teacher.dept and dept.id are matching key columns.

## Creating necessary table

In [5]:
%%sql
DROP TABLE IF EXISTS `teacher`;
CREATE TABLE `teacher` (
  `id` int(11) NOT NULL,
  `dept` int(11) DEFAULT NULL,
  `name` varchar(50) DEFAULT NULL,
  `phone` varchar(50) DEFAULT NULL,
  `mobile` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `dept` (`dept`)
) ENGINE=MyISAM DEFAULT CHARSET=latin1;

 * mysql://root:***@localhost/Problem_set_09
0 rows affected.
0 rows affected.

[]

In [6]:
%%sql
desc teacher

 * mysql://root:***@localhost/Problem_set_09
5 rows affected.

[('id', 'int', 'NO', 'PRI', None, ''),
 ('dept', 'int', 'YES', 'MUL', None, ''),
 ('name', 'varchar(50)', 'YES', '', None, ''),
 ('phone', 'varchar(50)', 'YES', '', None, ''),
 ('mobile', 'varchar(50)', 'YES', '', None, '')]

In [7]:
%%sql
DROP TABLE IF EXISTS `dept`;
CREATE TABLE `dept` (
  `id` int(11) NOT NULL,
  `name` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=latin1;

 * mysql://root:***@localhost/Problem_set_09
0 rows affected.
0 rows affected.

[]

In [8]:
%%sql
desc dept

 * mysql://root:***@localhost/Problem_set_09
2 rows affected.

[('id', 'int', 'NO', 'PRI', None, ''),
 ('name', 'varchar(50)', 'YES', '', None, '')]

## Loading data to the table

In [9]:
%%sql
INSERT INTO `teacher` VALUES (101,1,'Shrivell','2753','07986 555 1234'),(102,1,'Throd','2754','07122 555 1920'),(103,1,'Splint','2293',NULL),(104,NULL,'Spiregrain',NULL,NULL),(105,2,'Cutflower','3212','07996 555 6574'),(106,NULL,'Deadyawn','3345',NULL);

 * mysql://root:***@localhost/Problem_set_09
6 rows affected.

[]

In [10]:
%%sql
INSERT INTO `dept` VALUES (1,'Computing'),(2,'Design'),(3,'Engineering');

 * mysql://root:***@localhost/Problem_set_09
3 rows affected.

[]

In [11]:
%%sql
SELECT * FROM teacher;

 * mysql://root:***@localhost/Problem_set_09
6 rows affected.

[(101, 1, 'Shrivell', '2753', '07986 555 1234'),
 (102, 1, 'Throd', '2754', '07122 555 1920'),
 (103, 1, 'Splint', '2293', None),
 (104, None, 'Spiregrain', None, None),
 (105, 2, 'Cutflower', '3212', '07996 555 6574'),
 (106, None, 'Deadyawn', '3345', None)]

In [12]:
%%sql
SELECT * FROM dept;

 * mysql://root:***@localhost/Problem_set_09
3 rows affected.

[(1, 'Computing'), (2, 'Design'), (3, 'Engineering')]

### Problem 1: List the teachers who have NULL for their department.

In [13]:
%%sql
SELECT name
FROM teacher
WHERE dept IS NULL

 * mysql://root:***@localhost/Problem_set_09
2 rows affected.

[('Spiregrain',), ('Deadyawn',)]

### Problem 2: INNER JOIN misses the teachers with no department and the departments with no teacher. Use a  different JOIN so that all teachers are listed.

In [15]:
%%sql
SELECT t.name,d.name AS dept
FROM teacher t LEFT JOIN dept d
ON t.dept=d.id

 * mysql://root:***@localhost/Problem_set_09
6 rows affected.

[('Shrivell', 'Computing'),
 ('Throd', 'Computing'),
 ('Splint', 'Computing'),
 ('Spiregrain', None),
 ('Cutflower', 'Design'),
 ('Deadyawn', None)]

### Problem 3:	Use a different JOIN so that all departments are listed.

In [17]:
%%sql
SELECT t.name,d.name AS  dept
FROM teacher t RIGHT JOIN dept d
ON t.dept=d.id

 * mysql://root:***@localhost/Problem_set_09
5 rows affected.

[('Shrivell', 'Computing'),
 ('Throd', 'Computing'),
 ('Splint', 'Computing'),
 ('Cutflower', 'Design'),
 (None, 'Engineering')]

### Problem 4:	Show teacher name and mobile number .Use the number '07986 444 2266' if there is no number given.

In [18]:
%%sql
SELECT name,COALESCE(mobile,'07986 444 2266') AS mobile
FROM teacher

 * mysql://root:***@localhost/Problem_set_09
6 rows affected.

[('Shrivell', '07986 555 1234'),
 ('Throd', '07122 555 1920'),
 ('Splint', '07986 444 2266'),
 ('Spiregrain', '07986 444 2266'),
 ('Cutflower', '07996 555 6574'),
 ('Deadyawn', '07986 444 2266')]

### Problem 5:	Use the COALESCE function and a LEFT JOIN to print the teacher name and department name. Use the string 'None' where there is no department.

In [19]:
%%sql
SELECT t.name,COALESCE(d.name,'None') AS  dept
FROM teacher t LEFT JOIN dept d
ON t.dept=d.id

 * mysql://root:***@localhost/Problem_set_09
6 rows affected.

[('Shrivell', 'Computing'),
 ('Throd', 'Computing'),
 ('Splint', 'Computing'),
 ('Spiregrain', 'None'),
 ('Cutflower', 'Design'),
 ('Deadyawn', 'None')]

### Problem 6:	Use COUNT to show the number of teachers and the number of mobile phones.

In [20]:
%%sql
SELECT COUNT(name) AS 'Number of teachers',COUNT(mobile) AS 'Number of mobiles'
FROM teacher

 * mysql://root:***@localhost/Problem_set_09
1 rows affected.

[(6, 3)]

### Problem 7: Use COUNT and GROUP BY dept.name to show each department and the number of staff. Use a RIGHT JOIN to ensure that the Engineering department is listed.

In [21]:
%%sql
SELECT d.name,COUNT(t.name) AS 'Number of staff'
FROM teacher t RIGHT JOIN dept d
ON t.dept=d.id
GROUP BY d.name

 * mysql://root:***@localhost/Problem_set_09
3 rows affected.

[('Computing', 3), ('Design', 1), ('Engineering', 0)]

### Problem 8:	Use CASE to show the name of each teacher followed by 'Sci' if the teacher is in dept 1 or 2 and 'Art' otherwise.

In [22]:
%%sql
SELECT t.name,
CASE
    WHEN d.id IN (1,2) THEN 'Sci'
    ELSE 'Art'
END AS 'group'
FROM teacher t LEFT JOIN dept d
ON t.dept=d.id

 * mysql://root:***@localhost/Problem_set_09
6 rows affected.

[('Shrivell', 'Sci'),
 ('Throd', 'Sci'),
 ('Splint', 'Sci'),
 ('Spiregrain', 'Art'),
 ('Cutflower', 'Sci'),
 ('Deadyawn', 'Art')]

### Problem 9: Use CASE to show the name of each teacher followed by 'Sci' if the teacher is in dept 1 or 2, show 'Art' if the teacher's dept is 3 and 'None' otherwise.

In [23]:
%%sql
SELECT t.name,
CASE
    WHEN d.id IN (1,2) THEN 'Sci'
    WHEN d.id=3 THEN 'Art'
    ELSE 'None'
END AS 'group'
FROM teacher t LEFT JOIN dept d
ON t.dept=d.id

 * mysql://root:***@localhost/Problem_set_09
6 rows affected.

[('Shrivell', 'Sci'),
 ('Throd', 'Sci'),
 ('Splint', 'Sci'),
 ('Spiregrain', 'None'),
 ('Cutflower', 'Sci'),
 ('Deadyawn', 'None')]

 ### Problem 10: Obtained from the following result.
 ![Cat](dataset/question_2.png)

In [26]:
 %%sql
SELECT name, 
        CASE 
          WHEN dept IN (1) THEN 'Computing' 
          ELSE 'Other' 
        END AS dept
FROM teacher

 * mysql://root:***@localhost/Problem_set_09
6 rows affected.

[('Shrivell', 'Computing'),
 ('Throd', 'Computing'),
 ('Splint', 'Computing'),
 ('Spiregrain', 'Other'),
 ('Cutflower', 'Other'),
 ('Deadyawn', 'Other')]